app/controllers/school_classes_controller.rb

    def create
        # @school_class = SchoolClass.create(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
        @school_class = SchoolClass.create(school_class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Sewing 201"], ["room_number", 202], ["created_at", "2020-04-09 19:30:02.392851"], ["updated_at", "2020-04-09 19:30:02.392851"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        # @school_class.update(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
        @school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 203], ["updated_at", "2020-04-09 19:32:21.685647"], ["id", 9]]