app/controllers/students_controller.rb

    def create
        # @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
        @student = Student.create(student_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Richard"], ["last_name", "Bobo"], ["created_at", "2020-04-09 19:46:02.505231"], ["updated_at", "2020-04-09 19:46:02.505231"]]

    def update
        @student = Student.find(params[:id])
        # @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
        @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Bobo-Bobo"], ["updated_at", "2020-04-09 19:47:51.417398"], ["id", 1]]